//Задание 1
// #include <iostream>
//
//int main() {
//    std::cout << "Вы помните,\n"
//        "Вы всё, конечно, помните,\n"
//        "Как вечер шелестел мелано\n"
//        "И осень тихою вдовой\n"
//        "Шагала в даль туманную...\n\n"
//        "Автор: Сергей Есенин\n";
//
//    return 0;
//}

//Задание 2
//#include <iostream>
//
//int main() {
//    std::cout << "Every hunter wants to know where the pheasant dwells:\n"
//        << "\tRed,\n"
//        << "\t\tOrange,\n"
//        << "\t\t\tYellow,\n"
//        << "\t\t\t\tGreen,\n"
//        << "\t\t\t\t\tBlue,\n"
//        << "\t\t\t\t\t\tIndigo,\n"
//        << "\t\t\t\t\t\t\tViolet.\n";
//
//    return 0;
//}

//Задание 3
//#include <iostream>
//
//int main() {
//    std::cout << "Продаётся отличный велосипед!\n"
//        << "Модель: Stels Navigator 310\n"
//        << "Год выпуска: 2022\n"
//        << "Цвет: синий\n"
//        << "Цена: 15 тысяч рублей\n"
//        << "Контактный телефон: +7 (900) 123-45-67\n"
//        << "Торговля возможна!";
//
//    return 0;
//}